driver-tests/bpelse/dynamicpartnerlink/correlation/correlationJbi/test/CorrInvRecW1D6_Correlation/Input2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inv="CorrInvRecW1D6Parent">
  <soapenv:Body>
    <inv:CorrInvRecW1D6ParentElement>
      <inv:string>input</inv:string>
    </inv:CorrInvRecW1D6ParentElement>
  </soapenv:Body>
</soapenv:Envelope>